import { Container, Row } from "react-bootstrap";
import { HeroImage } from "./HeroImage";
import { Link } from "react-router-dom";
import { WelcomeSection } from "./WelcomeSection";
import { FeatureCard } from "./FeatureCard";
import { HomeBorder } from "./HomeBorder";

export const HomePageLayout = ({ user }) => {
  const isPremium = user?.subscription === "premium";
  const role = user?.role;

  return (
    <>
      <Container className="py-5">
        <Row className="align-items-center">
          {isPremium && (role === "patient" || role === "guardian") && (
            <WelcomeSection
              title={" Добре дошли в MedConnect+ Premium"}
              description={
                "Вашият личен здравен асистент — проверявайте симптоми, търсете болници и аптеки, управлявайте прегледи, лекарства, имунизации, профилактики и медицински досиета на едно сигурно място."
              }
              redirectUrl={"/register"}
            />
          )}

          {isPremium === false &&
            (role === "patient" || role === "guardian") && (
              <WelcomeSection
                title={" Добре дошли в MedConnect+"}
                description={
                  "Вашият личен здравен асистент — търсете болници и аптеки, управлявайте прегледи, лекарства и медицински досиета на едно сигурно място."
                }
                redirectUrl={"/register"}
              />
            )}

          {role === "doctor" && (
            <WelcomeSection
              title={" Добре дошли в MedConnect+"}
              description={
                "Вашият личен здравен асистент — проверявайте отзивите си, следете графика си и получавайте достъп до информацията и медицинските документи на вашите пациенти."
              }
              redirectUrl={"/register"}
            />
          )}

          {role === undefined && (
            <WelcomeSection
              title={" Добре дошли в MedConnect+"}
              description={
                "Вашият личен здравен асистент. Ако сте пациент или настойник - търсете болници и аптеки, управлявайте прегледи, лекарства и медицински досиета. Ако сте лекар - проверявайте отзиви, следете графика си и получавайте достъп до информацията и медицинските документи на вашите пациенти."
              }
              redirectUrl={"/register"}
            />
          )}

          <HeroImage />
        </Row>

        <HomeBorder />

        <Row className="justify-content-center g-4 mt-4">
          {(role === "patient" || role === "guardian") && (
            <>
              <FeatureCard
                title={"​​👨‍⚕️ Запазване на часове"}
                description={
                  "С MedConnect+ можете лесно да записвате часове при лекари, да следите предстоящи консултации и никога повече да не пропускате преглед."
                }
              />
              <FeatureCard
                title={"💊 Календар за лекарства"}
                description={
                  "Следете приема на своите медикаменти чрез удобен календар и поддържайте лечението си организирано и под контрол."
                }
              />
              <FeatureCard
                title={"📁 Защитено хранилище"}
                description={
                  "Съхранявайте медицинските си досиета на едно сигурно място и имайте достъп до тях по всяко време и навсякъде — надеждно защитени и лесни за споделяне с вашия лекар."
                }
              />
              <FeatureCard
                title={"🗺️ Близки аптеки и болници"}
                description={
                  "Открийте най-близките аптеки и болници спрямо вашето местоположение в реално време. Вижте ги на интерактивна карта, сравнете разстоянията и стартирайте навигация с едно докосване."
                }
              />
              {!isPremium && (
                <Row className="w-100 my-5">
                  <div className="text-center">
                    <h4 style={{ fontWeight: "bold", color: "#2e8b57" }}>
                      ⭐ Premium възможности
                    </h4>
                    <p className="text-muted">
                      Отключете допълнителни функционалности за пълен контрол
                      върху вашето здраве.
                    </p>
                    <hr style={{ width: "60%", margin: "0 auto" }} />
                  </div>
                </Row>
              )}
              <FeatureCard
                title={"💊 Напомняния за медикаменти"}
                description={
                  "Освободете се от стреса при управлението на лечението си. Получавайте автоматични известия за всяко лекарство и бъдете в крак със своето здраве."
                }
                isPremium={user?.subscription === "free" || role === undefined}
              />
              <FeatureCard
                title={"🩺 Проверка на симптоми"}
                description={
                  "Въведете своите симптоми и получете автоматично предложение за възможна диагноза или подходящ специалист, към когото да се обърнете."
                }
                isPremium={user?.subscription === "free" || role === undefined}
              />
              <FeatureCard
                title={"💉 График на имунизации и профилактики"}
                description={
                  "Проследявайте важни имунизации и профилактични прегледи с автоматични напомняния и препоръки, за да поддържате своето здраве винаги под контрол."
                }
                isPremium={user?.subscription === "free" || role === undefined}
              />
            </>
          )}

          {role === "doctor" && (
            <>
              <FeatureCard
                title={"⭐ Отзиви от пациенти"}
                description={
                  "Преглеждайте мненията и оценките от вашите пациенти, за да подобрявате качеството на услугите си и да изграждате доверие."
                }
              />
              <FeatureCard
                title={"📅 Управление на графика"}
                description={
                  "Следете и организирайте своя график с прегледи и консултации на едно място, с бърз достъп до предстоящите часове."
                }
              />
              <FeatureCard
                title={"📄 Достъп до медицински документи"}
                description={
                  "Получавайте сигурен достъп до медицинската информация и документите на вашите пациенти по всяко време, когато ви е необходима."
                }
              />
            </>
          )}

          {role === undefined && (
            <>
              <h3 style={{ fontWeight: "bold", color: "#2e8b57" }}>
                🧑 Създадено за пациенти и настойници
              </h3>
              <p className="text-muted">
                Какви възможности предлага MedConnect+ за пациенти и настойници?
              </p>
              <FeatureCard
                title={"​​👨‍⚕️ Запазване на часове"}
                description={
                  "С MedConnect+ можете лесно да записвате часове при лекари, да следите предстоящи консултации и никога повече да не пропускате преглед."
                }
              />
              <FeatureCard
                title={"💊 Календар за лекарства"}
                description={
                  "Следете приема на своите медикаменти чрез удобен календар и поддържайте лечението си организирано и под контрол."
                }
              />
              <FeatureCard
                title={"📁 Защитено хранилище"}
                description={
                  "Съхранявайте медицинските си досиета на едно сигурно място и имайте достъп до тях по всяко време и навсякъде — надеждно защитени и лесни за споделяне с вашия лекар."
                }
              />
              <FeatureCard
                title={"🗺️ Близки аптеки и болници"}
                description={
                  "Открийте най-близките аптеки и болници спрямо вашето местоположение в реално време. Вижте ги на интерактивна карта, сравнете разстоянията и стартирайте навигация с едно докосване."
                }
              />
              {!isPremium && (
                <Row className="w-100 my-5">
                  <div className="text-center">
                    <h4 style={{ fontWeight: "bold", color: "#2e8b57" }}>
                      ⭐ Premium възможности
                    </h4>
                    <p className="text-muted">
                      Отключете допълнителни функционалности за пълен контрол
                      върху вашето здраве.
                    </p>
                    <hr style={{ width: "60%", margin: "0 auto" }} />
                  </div>
                </Row>
              )}
              <FeatureCard
                title={"💊 Напомняния за медикаменти"}
                description={
                  "Освободете се от стреса при управлението на лечението си. Получавайте автоматични известия за всяко лекарство и бъдете в крак със своето здраве."
                }
                isPremium={user?.subscription === "free" || role === undefined}
              />
              <FeatureCard
                title={"🩺 Проверка на симптоми"}
                description={
                  "Въведете своите симптоми и получете автоматично предложение за възможна диагноза или подходящ специалист, към когото да се обърнете."
                }
                isPremium={user?.subscription === "free" || role === undefined}
              />
              <FeatureCard
                title={"💉 График на имунизации и профилактики"}
                description={
                  "Проследявайте важни имунизации и профилактични прегледи с автоматични напомняния и препоръки, за да поддържате своето здраве винаги под контрол."
                }
                isPremium={user?.subscription === "free" || role === undefined}
              />{" "}
              <HomeBorder />
              <h3 style={{ fontWeight: "bold", color: "#2e8b57" }}>
                🧑‍⚕️ Създадено за лекари
              </h3>
              <p className="text-muted">
                Какви възможности предлага MedConnect+ за лекари?
              </p>
              <FeatureCard
                title={"⭐ Отзиви от пациенти"}
                description={
                  "Преглеждайте мненията и оценките от вашите пациенти, за да подобрявате качеството на услугите си и да изграждате доверие."
                }
              />
              <FeatureCard
                title={"📅 Управление на графика"}
                description={
                  "Следете и организирайте своя график с прегледи и консултации на едно място, с бърз достъп до предстоящите часове."
                }
              />
              <FeatureCard
                title={"📄 Достъп до медицински документи"}
                description={
                  "Получавайте сигурен достъп до медицинската информация и документите на вашите пациенти по всяко време, когато ви е необходима."
                }
              />
            </>
          )}
        </Row>
      </Container>

      {/* Линк към вход за администратор, само ако не е логнат админ */}
      {(!user || user.role !== "admin") && (
        <Container className="mt-4 mb-5 text-center">
          <Link
            to="/admin/login"
            style={{
              fontWeight: "bold",
              color: "#2e8b57",
              textDecoration: "underline",
              fontSize: "1.1rem",
            }}
          >
            Вход за администратор
          </Link>
        </Container>
      )}
    </>
  );
};
