import { Container, Row } from "react-bootstrap";
import { HeroImage } from "./HeroImage";
import { WelcomeSection } from "./WelcomeSection";
import { FeatureCard } from "./FeatureCard";
import { HomeBorder } from "./HomeBorder";

export const HomePageLayout = ({ user }) => {
  const isPremium = user?.subscription === "premium";

  return (
    <Container className="py-5">
      <Row className="align-items-center">
        {isPremium ? (
          <WelcomeSection
            title={" Добре дошли в MedConnect+ Premium"}
            description={
              "Вашият личен здравен асистент — проверявайте симптоми, управлявайте прегледи, лекарства, имунизации, профилактики и медицински досиета на едно сигурно място."
            }
            redirectUrl={"/register"}
          />
        ) : (
          <WelcomeSection
            title={" Добре дошли в MedConnect+"}
            description={
              "Вашият личен здравен асистент — управлявайте прегледи, лекарства и медицински досиета на едно сигурно място."
            }
            redirectUrl={"/register"}
          />
        )}
        <HeroImage />
      </Row>

      <HomeBorder />

      <Row className="justify-content-center g-4 mt-4">
        <FeatureCard
          title={"​​👨‍⚕️ Запазване на часове"}
          description={
            "С MedConnect можете лесно да записвате часове при лекари, да следите предстоящи консултации и никога повече да не пропускате преглед."
          }
        />
        <FeatureCard
          title={"💊 Календар за лекарства"}
          description={
            "Следете приема на своите медикаменти чрез удобен календар и поддържайте лечението си организирано и под контрол."
          }
        />

        {isPremium && (
          <FeatureCard
            title={"💊 Напомняния за медикаменти"}
            description={
              "Освободете се от стреса при управлението на лечението си. Получавайте автоматични известия за всяко лекарство и бъдете в крак със своето здраве."
            }
          />
        )}

        <FeatureCard
          title={"📁 Защитено хранилище"}
          description={
            "Съхранявайте медицинските си досиета на едно сигурно място и имайте достъп до тях по всяко време и навсякъде — надеждно защитени и лесни за споделяне с вашия лекар."
          }
        />
        {isPremium && (
          <FeatureCard
            title={"🩺 Проверка на симптоми"}
            description={
              "Въведете своите симптоми и получете автоматично предложение за възможна диагноза или подходящ специалист, към когото да се обърнете."
            }
          />
        )}
        {isPremium && (
          <FeatureCard
            title={"💉 График на имунизации и профилактики"}
            description={
              "Проследявайте важни имунизации и профилактични прегледи с автоматични напомняния и препоръки, за да поддържате своето здраве винаги под контрол."
            }
          />
        )}
      </Row>
    </Container>
  );
};
